app/views/top/index.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."list_id" = ?  [["list_id", 1]]
---
        <div class="cardWrapper">
        <% list.cards.each do |card|%>

SELECT "logs".* FROM "logs" WHERE "logs"."card_id" = ?  [["card_id", 1]]
---
                <div class="section_log">
                  <% card.logs.each do |log|%>