app/controllers/card_controller.rb

  def new
    @card = Card.new
    @list = List.find_by(id: params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @card = Card.new(card_params)
    if @card.save
---
INSERT INTO "cards" ("title", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "タスクだよ"], ["list_id", 1], ["created_at", "2019-09-17 11:28:25.132567"], ["updated_at", "2019-09-17 11:28:25.132567"]]

  def edit
    @card = Card.find_by(id: params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @card = Card.find_by(id: params[:id])
    if @card.update_attributes(card_params)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cards" SET "title" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["title", "タスクだよver02"], ["updated_at", "2019-09-17 11:47:21.121351"], ["id", 1]]