app/controllers/list_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "テストだよ"], ["user_id", 1], ["created_at", "2019-09-17 00:24:36.930632"], ["updated_at", "2019-09-17 00:24:36.930632"]]

  def edit
    @list = List.find_by(id: params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @list = List.find_by(id: params[:id])
    if @list.update_attributes(list_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "FirstPriority"], ["updated_at", "2019-09-22 07:51:11.529889"], ["id", 1]]