app/controllers/log_controller.rb

  def start_time
    parent = Card.find(params[:card_id])
    @log = Log.create!(created_at: Time.current.strftime("%H:%M:%S"), card: parent)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "logs" ("card_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["card_id", 1], ["created_at", "2019-09-22 07:08:46.642379"], ["updated_at", "2019-09-22 07:08:46.648632"]]

  def end_time
    parent = Card.find(params[:card_id])
    latest_log = Log.where(card: parent).order('created_at desc').first
    return redirect_to :root unless latest_log

    latest_log.update!(end_time: Time.current.strftime("%H:%M:%S"))
    latest_log.update!(total_time:latest_log.end_time - latest_log.created_at)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "logs".* FROM "logs" WHERE "logs"."card_id" = ? ORDER BY created_at desc LIMIT ?  [["card_id", 1], ["LIMIT", 1]]
UPDATE "logs" SET "end_time" = ?, "updated_at" = ? WHERE "logs"."id" = ?  [["end_time", "2019-09-22 07:47:26.890149"], ["updated_at", "2019-09-22 07:47:26.893791"], ["id", 2]]
UPDATE "logs" SET "total_time" = ?, "updated_at" = ? WHERE "logs"."id" = ?  [["total_time", "2019-09-22 11:30:28"], ["updated_at", "2019-09-22 11:30:28.907820"], ["id", 6]]