app/controllers/top_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."created_at" = ? ORDER BY created_at ASC LIMIT ?  [["user_id", 1], ["created_at", 1977], ["LIMIT", 1]]
---
  def index
    @list = List.where(user: current_user).order("created_at ASC")